Revit 2027 API
ElementStructuralTypeFilter(StructuralType, Boolean) Constructor
 Constructs a new instance of a filter to match elements by structural type, with the option to match all elements which are of the given structural type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementStructuralTypeFilter(
	StructuralType structuralType,
	bool inverted
)
Public Sub New (
	structuralType As StructuralType,
	inverted As Boolean
)
public:
ElementStructuralTypeFilter(
	StructuralType structuralType,
	bool inverted
)
new :
        structuralType : StructuralType *
        inverted : bool -> ElementStructuralTypeFilter
Parameters
structuralType StructuralType
 The structural type to match.
inverted Boolean
 True if the filter should match all elements which are not of the given structural type.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ElementStructuralTypeFilter Class
ElementStructuralTypeFilter Overload
Autodesk.Revit.DB Namespace